

/*
var data=[
         {caption:"楹﹀厹鍜屾垜鐨勫濡� ,
          desc:"瀵兼紨/缂栧墽/涓绘紨/" , 
          img:"img/01.jpg"
         }, 
         ];  */
        
//定义数组data，里面包含了海报对象，每个海报对象有各自的属性
var data = [];
var dataStr ="01,<br><br>"+  //连续2个<br>分隔符
            "导演:佐助<br>"+  //连续1个<br>分隔符
            "编剧:佐助<br>"+
            "主演:佐助<br>"+
            "时长:130min，2013-02-14<br><br><br>"+ //连续3个<br>分隔符
            
            "02,<br><br>"+
            "导演:七龙珠<br>"+
            "编剧:七龙珠<br>"+
            "主演:七龙珠<br>"+
            "时长:106min，2009-12-04<br><br><br>"+
            
            "03,<br><br>"+
            "导演:热血高校<br>"+
            "编剧:热血高校<br>"+
            "主演:热血高校<br>"+
            "时长:130min，2011-11-24<br><br><br>"+
            
            "04,<br><br>"+
            "导演:少羽<br>"+
            "编剧:少羽<br>"+
            "主演:少羽<br>"+
            "时长:96min，2009-06-22<br><br><br>"+
            
            "05,<br><br>"+
            "导演:死神<br>"+
            "编剧:八队长<br>"+
            "主演:八队长<br>"+
            "时长:130min，2014-07-16<br><br><br>"+
            
            "06,<br><br>"+
            "导演:死神<br>"+
            "编剧:雨田<br>"+
            "主演:雨田<br>"+
            "时长:140min，2007-09-12<br><br><br>"+
            
            "07,<br><br>"+
            "导演:死神<br>"+
            "编剧:七队长<br>"+
            "主演:日番谷<br>"+
            "时长:130min，2007-09-04<br><br><br>"+ 
            
            "08,<br><br>"+ //将 08, --> 08.jpg
            "导演:死神<br>"+
            "编剧:黑崎一护<br>"+
            "主演:黑崎一护<br>"+
            "时长:130min，2007-09-04<br><br><br>"+
            
            "09,<br><br>"+ //将 08, --> 09.jpg
            "导演:龙猫<br>"+
            "编剧:龙猫<br>"+
            "主演:龙猫<br>"+
            "时长:130min，2015-12-04<br><br><br>"+
            
            "10,<br><br>"+ //将 08, --> 10.jpg
            "导演:基隆<br>"+
            "编剧:台湾<br>"+
            "主演:基隆<br>"+
            "时长:130min，2002-04-16<br><br><br>"+
            
            "11,<br><br>"+ //将 08, --> 11.jpg
            "导演:千与千寻<br>"+
            "编剧:宫崎骏<br>"+
            "主演:小千<br>"+
            "时长:130min，2001-09-02<br><br><br>"+
            
            "12,<br><br>"+ //将 08, --> 12.jpg
            "导演:魔女宅急便<br>"+
            "编剧:宫崎骏<br>"+
            "主演:琪琪<br>"+
            "时长:130min，1989-03-04<br><br><br>"+
            
            "13,<br><br>"+ //将 08, --> 13.jpg
            "导演:千与千寻<br>"+
            "编剧:宫崎骏<br>"+
            "主演:小龙<br>"+
            "时长:130min，2001-09-02<br><br><br>"+
            
            "14,<br><br>"+ //将 08, --> 13.jpg
            "导演:海贼王<br>"+
            "编剧:路飞<br>"+
            "主演:尾田荣一郎<br>"+
            "时长:130min，1997-12-08<br><br><br>"+
            
            "15,<br><br>"+ //将 08, --> 13.jpg
            "导演:海贼王<br>"+
            "编剧:路飞<br>"+
            "主演:尾田荣一郎<br>"+
            "时长:130min，1997-12-08<br><br><br>"+

            "16,<br><br>"+ //将 08, --> 13.jpg
            "导演:海贼王<br>"+
            "编剧:路飞<br>"+
            "主演:尾田荣一郎<br>"+
            "时长:130min，1997-12-08<br>"
            
            ;        
     //d就是全部海报对象的集合（8个海报）
  var d = dataStr.split("<br><br><br>"); //以连续3个<br>作为分隔      
     for (var i=0; i < d.length; i++) { //i的下标从0~7（8个海报）
          var c=d[i].split("<br><br>");//以连续2个<br>作为分隔（分为开头的数字和下面的说明）
          //追加信息到data数组中
          data.push({ 
          	img:c[0].replace(",","")+".jpg", //将 08, --> 08.jpg
          	caption:c[0].replace(",","标题"),//.split(",")[1],//标题
          	desc:c[1] //导演，编剧，主演，时长
          });
          // console.log(c[0].replace(",","")+".jpg");
          // console.log(c[1]);
     };   
         
         
         
         
         
         




